# Дан список чисел. Определите, сколько в нем встречается различных чисел.

digit_list = [1, 7, 9, 9, 0]
digit_list = set(digit_list)
print(len(digit_list))